[
    {
        "name": "BRAISED SHORT RIBS",
        "ingredients": [
            "¼ cup canola oil",
            "2 pounds boneless beef short ribs, cut into 2-inch cubes",
            "Kosher salt",
            "2 cups dry red wine",
            "2 cups peeled pearl onions",
            "6 large garlic cloves",
            "4 medium carrots, cut into 2-inch rounds",
            "4 cups (l quart) beef stock",
            "1 tablespoon red wine vinegar",
            "1 tablespoon Dijon mustard"
        ],
        "instructions": "Preheat the oven to 350°F.\n\nBROWN THE BEEF: Heat a Dutch oven over medium heat and add the oil. Arrange the beef cubes in a single layer on a tray and season on all sides with salt. When the oil begins to smoke lightly, remove the pot from the heat and add the beef cubes in a single layer. Return the pot to the heat and cook the meat, undisturbed, until browned, 8 to 10 minutes. Use tongs to turn the meat and continue to brown on all sides for an additional 10 to 12 minutes total. Add the wine and cook until the liquid is reduced to about ¼ cup, 6 to 8 minutes.\n\nBRAISE THE BEEF: Add the onions, garlic, carrots, and beef stock along with 2 cups water. Bring the liquid to a simmer over medium heat and use a ladle or a large spoon to skim off any impurities that rise to the surface. Place the pot in the center of the oven and braise until the meat is fork-tender, 1½ to 2 hours (test the meat by flaking it with 2 forks—it should not resist at all when you pull the meat apart; if it does, braise for longer). Remove the pot from the oven and stir in the vinegar and mustard. Taste for seasoning. Allow the meat to rest for 15 minutes before serving."
    },
    {
        "name": "BEEF TENDERLOIN AU POIVRE",
        "ingredients": [
            "4 (6- to 7-ounce), 1½-inch-thick beef tenderloin steaks",
            "Kosher salt",
            "2 tablespoons black peppercorns",
            "coarsely cracked",
            "2 tablespoons canola oil",
            "2 large garlic cloves, grated",
            "1 tablespoon Dijon mustard",
            "1 tablespoon Worcestershire sauce",
            "1 cup beef stock",
            "Maldon flaky sea salt"
        ],
        "instructions": "GET READY: Season the steaks generously on both sides with kosher salt. Add the pepper to a plate and roll each steak in the pepper, generously coating all sides. Press the pepper into the meat to make sure it sticks. Cutting Board\n\nCOOK THE STEAK: Heat a cast-iron or heavy-bottomed skillet over medium heat and add the oil. When the oil begins to smoke lightly, remove the pan from the heat and use a pair of tongs to carefully set the steaks in the hot oil, making sure to leave space between each piece. Return the pan to the heat and cook them on the first side for 2 to 3 minutes until browned and then turn them onto the second side and cook for another 2 to 3 minutes (your kitchen will get smoky—that's okay!). Use a meat thermometer to check for doneness (see page 154). If you like your steak more on the well-done side, leave it in the pan for 2 to 3 minutes longer on each side.\n\nMAKE THE SAUCE: In a small bowl, stir together the garlic, mustard, and Worcestershire. Decrease the heat to medium-low and add the garlic mixture to the pan, swirling around the meat and spooning the sauce over it too. Use tongs to transfer the steaks to a plate (leave the sauce in the pan) and set aside to rest for a few minutes. Add the stock to the pan and simmer over medium heat until the sauce thickens slightly, 3 to 5 minutes. Taste for seasoning.\n\nSERVE: Serve the steaks with the sauce on individual plates or family-style on a platter. Finish with a sprinkle of Maldon salt."
    },
    {
        "name": "AGLIO E OLIO",
        "ingredients": [
            "¼ cup extra-virgin olive oil",
            "12 large garlic cloves, thinly sliced",
            "Kosher salt",
            "½ teaspoon dried red pepper flakes",
            "12 sprigs of flat-leaf parsley, chopped, stems and all",
            "Juice of 1 large lemon",
            "1 pound spaghetti",
            "1 small block of pecorino cheese"
        ],
        "instructions": "MAKE THE SAUCE: Set a medium saucepan over medium-low heat (if the pan is smoking hot, the garlic will burn). Pour in the olive oil and once you see ripples forming in the oil, add the garlic and sauté with a pinch of salt and the red pepper flakes. Cook for 8 minutes, stirring from time to time, and then kill the heat. Stir the parsley into the garlic and oil—the residual heat will finish the cooking without burning anything. Add the lemon juice.\n\nCOOK THE PASTA: Bring a large pot of water to a rolling boil. Season the water with salt (it should taste like mild seawater), add the spaghetti, and cook, stirring with a slotted spoon to make sure the pasta doesn't clump or stick to the bottom as it cooks, until tender but still chewy, or al dente, 5 to 8 minutes. Set 1 cup of pasta water aside, then drain the pasta in a large colander.\n\nASSEMBLE AND SERVE: Transfer the pasta into the sauce. If the sauce looks too thick, loosen with some of the pasta water, adding a little at a time, and toss with tongs or a large metal spoon until you have the consistency you want (I like mine well combined but loose enough to enjoy the pasta mixing with the sauce). Grate the cheese over top."
    },
    {
        "name": "CAST-IRON PAPRIKA CHICKEN",
        "ingredients": [
            "2 (5 to 6-ounce) boneless, skin-on chicken breasts",
            "Kosher salt",
            "½ teaspoon sweet, smoky, or hot paprika",
            "2 tablespoons extra virgin olive oil",
            "2 large garlic cloves, grated",
            "1 small yellow onion, halved and thinly sliced",
            "½ pound (8 ounces) white button mushrooms, stemmed and sliced",
            "½ cup dry white wine",
            "Zest and juice of 1 large lemon"
        ],
        "instructions": "SEASON THE CHICKEN: Season both sides of the chicken breasts with a sprinkle of salt and use a small fine-mesh strainer to dust the chicken with the paprika. (You can always get an even coating of powdered spices on anything if you 'crop dust\" by putting the spice in a small strainer and sprinkling.)\n\nCOOK THE CHICKEN: Heat 2 tablespoons of the olive oil in a large cast-iron skillet over medium heat until it smokes lightly. Remove the pan from the heat and add the chicken breasts, rounded side down, leaving a little space between them. Return the pan to the heat and cook until golden brown, 5 to 7 minutes. Use a pair of metal tongs or a metal spatula to flip the chicken to its second side and cook until a meat thermometer inserted into the thickest part registers 165°F, 5 to 7 additional minutes. Transfer the chicken to a plate to rest while you make the sauce. Don't wash the pan—you will use it to make the sauce.\n\nMAKE THE SAUCE: Discard all but a little bit of grease from the pan. Add the garlic, onion, mushrooms, and a pinch of salt. Cook over medium heat until the mushrooms are tender, 3 to 5 minutes. Add the wine and reduce until almost all the liquid cooks down. Stir in a splash of water and the lemon zest and juice. Taste for seasoning and reduce the heat to medium-low.\n\nSERVE: Place the breasts in the sauce and spoon the sauce over the meat, warming it gently so it stays moist. Serve with the sauce."
    }
]